results/data/run4/jvm-static/erik-laptop/quarkus-worker-pool-70000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 73.438ms, rate sampling interval: 267ms
  Thread calibration: mean lat.: 53.838ms, rate sampling interval: 182ms
  Thread calibration: mean lat.: 78.011ms, rate sampling interval: 302ms
  Thread calibration: mean lat.: 112.564ms, rate sampling interval: 387ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   237.30ms  240.38ms   1.58s    84.69%
    Req/Sec    17.35k     1.92k   23.18k    69.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  146.69ms
 75.000%  322.30ms
 90.000%  563.71ms
 99.000%    1.17s 
 99.900%    1.46s 
 99.990%    1.53s 
 99.999%    1.57s 
100.000%    1.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.180     0.000000            1         1.00
      37.983     0.100000       346102         1.11
      58.463     0.200000       691794         1.25
      81.599     0.300000      1037637         1.43
     110.847     0.400000      1383316         1.67
     146.687     0.500000      1729389         2.00
     170.239     0.550000      1901595         2.22
     200.319     0.600000      2074660         2.50
     236.287     0.650000      2247538         2.86
     275.455     0.700000      2420433         3.33
     322.303     0.750000      2593488         4.00
     351.231     0.775000      2679868         4.44
     391.423     0.800000      2765979         5.00
     441.343     0.825000      2852723         5.71
     482.559     0.850000      2939304         6.67
     518.655     0.875000      3025449         8.00
     539.135     0.887500      3068535         8.89
     563.711     0.900000      3111727        10.00
     592.895     0.912500      3155568        11.43
     628.223     0.925000      3198505        13.33
     677.375     0.937500      3241615        16.00
     704.511     0.943750      3263124        17.78
     730.111     0.950000      3284860        20.00
     755.711     0.956250      3306225        22.86
     785.407     0.962500      3327931        26.67
     821.247     0.968750      3349560        32.00
     846.847     0.971875      3360321        35.56
     878.591     0.975000      3371000        40.00
     911.871     0.978125      3381793        45.71
     948.223     0.981250      3392685        53.33
     998.399     0.984375      3403415        64.00
    1057.791     0.985938      3408812        71.11
    1110.015     0.987500      3414299        80.00
    1147.903     0.989062      3419660        91.43
    1183.743     0.990625      3425127       106.67
    1224.703     0.992188      3430526       128.00
    1244.159     0.992969      3433194       142.22
    1262.591     0.993750      3435944       160.00
    1282.047     0.994531      3438605       182.86
    1308.671     0.995313      3441217       213.33
    1337.343     0.996094      3444008       256.00
    1349.631     0.996484      3445354       284.44
    1362.943     0.996875      3446611       320.00
    1378.303     0.997266      3448035       365.71
    1394.687     0.997656      3449353       426.67
    1412.095     0.998047      3450730       512.00
    1420.287     0.998242      3451347       568.89
    1429.503     0.998437      3452058       640.00
    1437.695     0.998633      3452687       731.43
    1446.911     0.998828      3453377       853.33
    1457.151     0.999023      3454059      1024.00
    1462.271     0.999121      3454372      1137.78
    1469.439     0.999219      3454752      1280.00
    1475.583     0.999316      3455052      1462.86
    1484.799     0.999414      3455419      1706.67
    1492.991     0.999512      3455729      2048.00
    1498.111     0.999561      3455914      2275.56
    1503.231     0.999609      3456096      2560.00
    1507.327     0.999658      3456230      2925.71
    1513.471     0.999707      3456429      3413.33
    1517.567     0.999756      3456581      4096.00
    1520.639     0.999780      3456680      4551.11
    1522.687     0.999805      3456745      5120.00
    1525.759     0.999829      3456844      5851.43
    1528.831     0.999854      3456931      6826.67
    1531.903     0.999878      3457000      8192.00
    1533.951     0.999890      3457047      9102.22
    1535.999     0.999902      3457100     10240.00
    1537.023     0.999915      3457115     11702.86
    1540.095     0.999927      3457165     13653.33
    1543.167     0.999939      3457208     16384.00
    1544.191     0.999945      3457225     18204.44
    1545.215     0.999951      3457244     20480.00
    1547.263     0.999957      3457273     23405.71
    1549.311     0.999963      3457287     27306.67
    1552.383     0.999969      3457309     32768.00
    1553.407     0.999973      3457321     36408.89
    1554.431     0.999976      3457331     40960.00
    1555.455     0.999979      3457337     46811.43
    1558.527     0.999982      3457350     54613.33
    1560.575     0.999985      3457360     65536.00
    1561.599     0.999986      3457364     72817.78
    1563.647     0.999988      3457371     81920.00
    1564.671     0.999989      3457374     93622.86
    1566.719     0.999991      3457383    109226.67
    1567.743     0.999992      3457386    131072.00
    1568.767     0.999993      3457389    145635.56
    1568.767     0.999994      3457389    163840.00
    1569.791     0.999995      3457392    187245.71
    1571.839     0.999995      3457396    218453.33
    1572.863     0.999996      3457397    262144.00
    1574.911     0.999997      3457399    291271.11
    1575.935     0.999997      3457401    327680.00
    1575.935     0.999997      3457401    374491.43
    1577.983     0.999998      3457403    436906.67
    1579.007     0.999998      3457404    524288.00
    1580.031     0.999998      3457405    582542.22
    1580.031     0.999998      3457405    655360.00
    1581.055     0.999999      3457407    748982.86
    1581.055     0.999999      3457407    873813.33
    1581.055     0.999999      3457407   1048576.00
    1582.079     0.999999      3457409   1165084.44
    1582.079     0.999999      3457409   1310720.00
    1582.079     0.999999      3457409   1497965.71
    1582.079     0.999999      3457409   1747626.67
    1582.079     1.000000      3457409   2097152.00
    1582.079     1.000000      3457409   2330168.89
    1582.079     1.000000      3457409   2621440.00
    1582.079     1.000000      3457409   2995931.43
    1583.103     1.000000      3457410   3495253.33
    1583.103     1.000000      3457410          inf
#[Mean    =      237.303, StdDeviation   =      240.382]
#[Max     =     1582.080, Total count    =      3457410]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4156689 requests in 1.00m, 344.88MB read
Requests/sec:  69278.72
Transfer/sec:      5.75MB